## Merging & Transforming Datasets

### Q1

In [1]:
# Importing the Modules
import pandas as pd

In [2]:
sales_data = pd.read_csv('../DMW_DataSets/sales_data.csv',)
sales_data.head()

,Transaction ID,Date,Customer ID,Product ID,Quantity,Unit Price,Total Price
0,TXN0001,15-07-2024,CUST0040,PID001,10,200,2000.0
1,TXN0002,26-10-2024,CUST0033,PID005,10,350,3500.0
2,TXN0003,30-07-2024,CUST0012,PID006,7,500,NaN
3,TXN0004,22-12-2024,CUST0010,PID007,6,100,600.0
4,TXN0005,10-04-2024,CUST0044,PID003,3,400,1200.0

In [3]:
customer_data = pd.read_csv('../DMW_DataSets/customer_data.csv')
customer_data.head()

,Customer ID,Name,Email,Phone Number,Address
0,CUST0001,Daniel Brown,NaN,(554) 888-8063,"516 Elm St, Hilltop, TX 79264"
1,CUST0002,Grace Garcia,grace.garcia@outlook.com,(843) 751-8415,"130 Main St, Riverside, TX 11075"
2,CUST0003,Charlie Davis,charlie.davis@yahoo.com,(192) 638-2389,"717 Main St, Riverside, FL 19334"
3,CUST0004,Alice Brown,alice.brown@outlook.com,(373) 684-9222,"368 Cedar St, Townsville, OH 28036"
4,CUST0005,Emily Johnson,emily.johnson@gmail.com,(856) 557-6464,"679 Oak St, Cityville, CA 61428"

In [4]:
# Merge the Datasets
merged_data = pd.merge(sales_data, customer_data, on='Customer ID', how='inner')
merged_data.head()

,Transaction ID,Date,Customer ID,Product ID,Quantity,Unit Price,Total Price,Name,Email,Phone Number,Address
0,TXN0001,15-07-2024,CUST0040,PID001,10,200,2000.0,Alice Miller,NaN,(722) 885-6293,"624 Oak St, Riverside, FL 77884"
1,TXN0017,29-09-2024,CUST0040,PID004,4,200,800.0,Alice Miller,NaN,(722) 885-6293,"624 Oak St, Riverside, FL 77884"
2,TXN0002,26-10-2024,CUST0033,PID005,10,350,3500.0,John Smith,john.smith@outlook.com,(733) 299-1696,"111 Maple St, Hilltop, OH 97521"
3,TXN0099,05-08-2024,CUST0033,PID004,8,150,1200.0,John Smith,john.smith@outlook.com,(733) 299-1696,"111 Maple St, Hilltop, OH 97521"
4,TXN0003,30-07-2024,CUST0012,PID006,7,500,NaN,Bob Johnson,bob.johnson@outlook.com,(324) 285-1102,"273 Cedar St, Sunset, MI 31662"

In [5]:
merged_data.rename(columns={
    'Date' : 'Transaction Date',
    'Quantity' : 'Quantity Sold',
    'Total Price' : 'Total Sales Amount',
    'Name' : 'Customer Name',
    'Email' : 'Customer Email',
    'Phone Number' : 'Customer Phone',
    'Address' : 'Customer Address'
},inplace=True)
merged_data.columns

Index(['Transaction ID', 'Transaction Date', 'Customer ID', 'Product ID',
       'Quantity Sold', 'Unit Price', 'Total Sales Amount', 'Customer Name',
       'Customer Email', 'Customer Phone', 'Customer Address'],
      dtype='object')

In [6]:
merged_data.dropna(subset=['Total Sales Amount'],inplace=True)
merged_data['Customer Email'].fillna('Unknown',inplace=True)

In [7]:
# merged_data['Total Sales Amount'].value_counts().sum()

In [8]:
# merged_data.head(10)

In [9]:
merged_data['Transaction Date'] = pd.to_datetime(merged_data['Transaction Date'])
print(merged_data.dtypes)

Transaction ID                object
Transaction Date      datetime64[ns]
Customer ID                   object
Product ID                    object
Quantity Sold                  int64
Unit Price                     int64
Total Sales Amount           float64
Customer Name                 object
Customer Email                object
Customer Phone                object
Customer Address              object
dtype: object

C:\Users\Yogesh Tatavdekar\AppData\Local\Temp\ipykernel_16220\1869377055.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  merged_data['Transaction Date'] = pd.to_datetime(merged_data['Transaction Date'])

In [10]:
total_sales_by_customer = merged_data.groupby(['Customer ID','Customer Name'])[['Total Sales Amount','Quantity Sold']].sum()
sales_by_product = merged_data.groupby(['Product ID'])[['Total Sales Amount', 'Quantity Sold']].sum()

In [11]:
merged_data['Transaction Month'] = merged_data['Transaction Date'].dt.to_period('M')
sales_by_month = merged_data.groupby('Transaction Month')[['Total Sales Amount']].sum()
print(sales_by_month)

                   Total Sales Amount
Transaction Month
2024-01                       11550.0
2024-02                       24150.0
2024-03                        8400.0
2024-04                       10900.0
2024-05                       11050.0
2024-06                        8550.0
2024-07                        6850.0
2024-08                        8800.0
2024-09                        3450.0
2024-10                        9300.0
2024-11                       19400.0
2024-12                       17300.0

In [12]:
transaction_per_customer = merged_data.groupby('Customer ID')['Transaction ID'].nunique()
print(transaction_per_customer)

Customer ID
CUST0001    1
CUST0002    1
CUST0003    1
CUST0004    1
CUST0005    1
CUST0006    2
CUST0007    2
CUST0008    1
CUST0009    2
CUST0010    2
CUST0011    1
CUST0012    2
CUST0013    3
CUST0014    3
CUST0015    2
CUST0016    2
CUST0017    4
CUST0019    3
CUST0020    1
CUST0021    1
CUST0022    3
CUST0023    2
CUST0024    3
CUST0025    3
CUST0026    5
CUST0027    1
CUST0028    2
CUST0030    6
CUST0031    2
CUST0033    2
CUST0034    1
CUST0035    4
CUST0036    1
CUST0037    2
CUST0039    2
CUST0040    2
CUST0041    1
CUST0042    2
CUST0043    7
CUST0044    4
CUST0045    2
CUST0046    2
CUST0049    1
CUST0050    1
Name: Transaction ID, dtype: int64

In [13]:
merged_data['Total Sales Amount'].min()

100.0

In [14]:
merged_data['Total Sales Amount'].max()

4500.0

In [15]:
merged_data.to_csv('../DMW_DataSets/merged_data.csv',index=False)

### Q2

In [16]:
# Importing the Modules
import pandas as pd

In [17]:
employee_data = {
    'employee_id' : [101,102,103,104],
    'name' : ['Alice', 'Bob', 'Charlie', 'Dravid'],
    'department_id' : [1,2,1,3],
    'position' : ['Developer', 'Manager', 'Developer', 'HR specialist'],
    'hire_date' : ['2020-01-15','2023-08-23','2019-03-12','2021-07-01'],
    'salary' : [80000,95000,85000,70000]
}

department_data = {
    'department_id' : [1,2,3],
    'department_name' : ['IT','Marketing', 'HR'],
    'manager_id' : [105,106,107],
    'location' : ['NewYork','Chicago','SanFrancisco']
}

In [18]:
df_employee = pd.DataFrame(employee_data)
df_department = pd.DataFrame(department_data)

In [19]:
df_merged = pd.merge(df_employee, df_department, on='department_id', how='left')
df_merged

,employee_id,name,department_id,position,hire_date,salary,department_name,manager_id,location
0,101,Alice,1,Developer,2020-01-15,80000,IT,105,NewYork
1,102,Bob,2,Manager,2023-08-23,95000,Marketing,106,Chicago
2,103,Charlie,1,Developer,2019-03-12,85000,IT,105,NewYork
3,104,Dravid,3,HR specialist,2021-07-01,70000,HR,107,SanFrancisco

In [20]:
df_cleaned = df_merged.dropna()
print("\nDataFrame after dropping rows with missing values: ")
df_cleaned

DataFrame after dropping rows with missing values:

,employee_id,name,department_id,position,hire_date,salary,department_name,manager_id,location
0,101,Alice,1,Developer,2020-01-15,80000,IT,105,NewYork
1,102,Bob,2,Manager,2023-08-23,95000,Marketing,106,Chicago
2,103,Charlie,1,Developer,2019-03-12,85000,IT,105,NewYork
3,104,Dravid,3,HR specialist,2021-07-01,70000,HR,107,SanFrancisco

In [21]:
df_merged['hire_date'] = pd.to_datetime(df_merged['hire_date'])

df_merged['years_of_service'] = (pd.to_datetime('today') - df_merged['hire_date']).dt.days // 365

In [22]:
total_salary = df_merged.groupby('department_name')['salary'].sum().reset_index()
total_salary.rename(columns={'salary':'total_salary'}, inplace=True)
total_salary

  department_name  total_salary
0              HR         70000
1              IT        165000
2       Marketing         95000

In [23]:
max_min_salary = df_merged.groupby('department_name')['salary'].agg(['max','min']).reset_index()
max_min_salary

  department_name    max    min
0              HR  70000  70000
1              IT  85000  80000
2       Marketing  95000  95000

In [24]:
avg_years_service = df_merged.groupby('department_name')['years_of_service'].mean().reset_index()
avg_years_service.rename(columns={'years_of_service' : 'avg_years_of_service'},inplace=True)
avg_years_service

  department_name  avg_years_of_service
0              HR                   3.0
1              IT                   5.5
2       Marketing                   1.0

In [25]:
position_dist = df_merged.groupby(['department_name', 'position']).size().reset_index()
position_dist

  department_name       position  0
0              HR  HR specialist  1
1              IT      Developer  2
2       Marketing        Manager  1

In [26]:
medain_salary = df_merged.groupby('department_name')['salary'].median().reset_index()
medain_salary.rename(columns={'salary':'median_salary'},inplace=True)
medain_salary

  department_name  median_salary
0              HR        70000.0
1              IT        82500.0
2       Marketing        95000.0

In [27]:
df_merged['hired_last_year'] = df_merged['hire_date'].dt.year == (pd.to_datetime('today').year-1)
hired_last_year_count = df_merged.groupby('department_name')['hired_last_year'].sum().reset_index()
hired_last_year_count

  department_name  hired_last_year
0              HR                0
1              IT                0
2       Marketing                0

In [28]:
df_summary = pd.merge(total_salary, max_min_salary, on='department_name', how='left')
df_summary = pd.merge(df_summary, avg_years_service, on='department_name', how='left')
df_summary = pd.merge(df_summary, medain_salary, on='department_name', how='left')
df_summary = pd.merge(total_salary, hired_last_year_count, on='department_name', how='left')
print(df_summary)

  department_name  total_salary  hired_last_year
0              HR         70000                0
1              IT        165000                0
2       Marketing         95000                0